#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
aws_db_subnet_group.subnet-rds: Refreshing state... [id=subnet-rds-fastburger]
aws_ecr_repository.repository: Refreshing state... [id=fastburger]
aws_cloudwatch_log_group.cloudwatch-log-group: Refreshing state... [id=ecs/fastburger]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:339712887556:cluster/FastBurger]
aws_security_group.sg-rds: Refreshing state... [id=sg-0210242f2f79c5f97]
aws_security_group.sg: Refreshing state... [id=sg-0283e561a6944968f]
aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:339712887556:targetgroup/TG-fastburger/89586df258c1b158]
aws_cloudwatch_log_stream.cloudwatch-log-stream: Refreshing state... [id=ecs]
aws_ecr_lifecycle_policy.repository-lifecycle: Refreshing state... [id=fastburger]
aws_ecr_repository_policy.repository-policy: Refreshing state... [id=fastburger]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:339712887556:loadbalancer/app/ALB-fastburger/c84d24855e490216]
aws_lb_listener.alb-listener-redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:339712887556:listener/app/ALB-fastburger/c84d24855e490216/36296d3942926c66]
aws_db_instance.rds: Refreshing state... [id=db-RSPKJHENSSO6Z5XOVRHUJ4ULPA]
aws_ecs_task_definition.task: Refreshing state... [id=TSK-fastburger]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:339712887556:service/FastBurger/SVC-fastburger]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:339712887556:service/FastBurger/SVC-fastburger"
        name                               = "SVC-fastburger"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:339712887556:task-definition/TSK-fastburger:14" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:339712887556:task-definition/TSK-fastburger:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:339712887556:task-definition/TSK-fastburger" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  ~ environment      = [
                        {
                            name  = "AWS_ACCESS_KEY_ID"
                            value = "AKIAU6GDXJMCKT4IH3XA"
                        },
                      + {
                          + name  = "AWS_COGNITO_USER_POOL_ID"
                          + value = "us-east-1_ssXveW6jC"
                        },
                        {
                            name  = "AWS_SECRET_ACCESS_KEY"
                            value = "kYwWGYH4AjhvBeWHFrqzD7KKpIi7kQcfnwqZPNUf"
                        },
                        # (7 unchanged elements hidden)
                    ]
                  - mountPoints      = []
                    name             = "fastburger"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "TSK-fastburger" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @Soatfiap, Action: `pull_request`, Working Directory: `terraform-gha`, Workflow: `Cria infra a partir do 'terraform-gha'`*